package com.xerecter.xrate.xrate_core.annotation;

import java.lang.annotation.*;

////////////////////////////////////////////////////////////////////
//                            _ooOoo_                                  //
//                           o8888888o                              //
//                           88" . "88                              //
//                           (| ^_^ |)                              //
//                           O\  =  /O                              //
//                        ____/`---'\____                              //
//                      .'  \\|     |//  `.                          //
//                     /  \\|||  :  |||//  \                          //
//                    /  _||||| -:- |||||-  \                          //
//                    |   | \\\  -  /// |   |                          //
//                    | \_|  ''\---/''  |   |                          //
//                    \  .-\__  `-`  ___/-. /                          //
//                  ___`. .'  /--.--\  `. . ___                      //
//                ."" '<  `.___\_<|>_/___.'  >'"".                  //
//              | | :  `- \`.;`\ _ /`;.`/ - ` : | |                  //
//              \  \ `-.   \_ __\ /__ _/   .-` /  /                 //
//        ========`-.____`-.___\_____/___.-`____.-'========          //
//                             `=---='                              //
//        ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^        //
//         佛祖保佑       永无BUG        永不修改                  //
////////////////////////////////////////////////////////////////////

/**
 * @author xdd
 */
@Retention(value = RetentionPolicy.RUNTIME)
@Target(value = ElementType.METHOD)
@Inherited
public @interface XrateTransaction {

    String value();

    /**
     * @return cancel 方法名称
     */
    String cancelMethod() default "";

}